app/controllers/buildings_controller.rb

SELECT "buildings".* FROM "buildings"
---
  def index
    # info = Array.new
    # for i in Building.all
    #   tmp = Hash.new
    #   tmp["Build"]=Building.get_classroms(i.id)
    #   info.push(tmp)
    # end
    # render json: info
    @building = Building.all

SELECT  "head_buildings".* FROM "head_buildings" WHERE "head_buildings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_building
      @building = Building.find(params[:id])