app/controllers/classroom_events_controller.rb

  def index

    @classroom_events = ClassroomEvent.all
---
SELECT "classroom_events".* FROM "classroom_events"

    def set_classroom_event
      @classroom_event = ClassroomEvent.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]