app/controllers/classroom_schedules_controller.rb

  def index
    @classroom_schedules = ClassroomSchedule.all
---
SELECT "classroom_schedules".* FROM "classroom_schedules"