app/controllers/cyclic_schedules_controller.rb

  def index
    info = Array.new
    for i in CyclicSchedule.all
---
SELECT "cyclic_schedules".* FROM "cyclic_schedules"