app/controllers/cyclic_requests_controller.rb

  def index
    @cyclic_requests = CyclicRequest.all
---
SELECT "cyclic_requests".* FROM "cyclic_requests"