app/controllers/events_controller.rb

  def index
    @events = Event.paginate(:page => params[:page], per_page: 2)
---
SELECT "events".* FROM "events"