app/controllers/faculties_controller.rb

SELECT "faculties".* FROM "faculties"
---
  def index
    @faculties = Faculty.paginate(:page => params[:page], per_page: 2)

INSERT INTO "faculties" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "artes oscuras"], ["created_at", "2018-04-12 02:48:23.282268"], ["updated_at", "2018-04-12 02:48:23.282268"]]
---
  def create
    @faculty = Faculty.new(faculty_params)

    if @faculty.save