app/controllers/groups_controller.rb

  def index
    @groups = Group.paginate(:page => params[:page], per_page: 2)
---
SELECT "groups".* FROM "groups"