app/controllers/head_buildings_controller.rb

SELECT "buildings".* FROM "buildings" WHERE "buildings"."head_building_id" = $1  [["head_building_id", 1]]
---
  def index
    @head_building = HeadBuilding.all

SELECT "buildings".* FROM "buildings" WHERE "buildings"."head_building_id" = $1  [["head_building_id", 21]]
---
  def all
    render json: HeadBuilding.all

SELECT  "head_buildings".* FROM "head_buildings" WHERE "head_buildings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_head_building
      @head_building = HeadBuilding.find(params[:id])