app/controllers/opinions_controller.rb

SELECT "opinions".* FROM "opinions"
---
  def index
    @opinions = Opinion.all