app/controllers/pets_controller.rb

INSERT INTO "pets" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "artes oscuras"], ["description", "i donou"], ["created_at", "2018-04-12 02:50:19.649590"], ["updated_at", "2018-04-12 02:50:19.649590"]]
---
  def create
    @pet = Pet.new(pet_params)

    if @pet.save