app/controllers/purpose_classrooms_controller.rb

SELECT "purpose_classrooms".* FROM "purpose_classrooms"
---
  def index
    @purpose_classrooms = PurposeClassroom.paginate(:page => params[:page], per_page: 2)