app/controllers/requests_controller.rb

  def create

    user = nil
    case params[:user_type]
    when "student"
      user = Student.find(params[:user_id])
    when "head_building"
      user = HeadBuilding.find(params[:user_id])
    when "teacher"
      user = Teacher.find(params[:user_id])
    when "external_person"
      user = ExternalPerson.find(params[:user_id])
    when "manager"
      user = Manager.find(params[:user_id])
    else
      render json: ["invalid user type:", params[:user_type]]
      return -1
    end

    @request = Request.new(request_params)
    if @request.save
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
INSERT INTO "requests" ("teacher_id", "purpose_classroom_id", "type_classroom_id", "external_person_id", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def set_status
    r = Request.find(params[:request_id])
    r.state = params[:new_state]
    r.save
    if params[:assign_cyclic] != nil
      for i in params[:assign_cyclic]
        r.classroom_schedules << ClassroomSchedule.find(i[:classroom_schedule_id])
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "type_classrooms".* FROM "type_classrooms" WHERE "type_classrooms"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]