app/controllers/request_alternatives_controller.rb

SELECT "request_alternatives".* FROM "request_alternatives"
---
  def index

    @request_alternatives = RequestAlternative.all