app/controllers/specific_requests_controller.rb

SELECT "specific_requests".* FROM "specific_requests"
---
  def index
    @specific_requests = SpecificRequest.all