app/controllers/specific_schedules_controller.rb

SELECT "specific_schedules".* FROM "specific_schedules"
---
  def index
    @specific_schedules = SpecificSchedule.all