app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.paginate(:page => params[:page], per_page: 10)
---
SELECT "subjects".* FROM "subjects"